{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "batch_input_shape": [null, 80, 160, 3], "b_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_1", "nb_filter": 32, "border_mode": "valid", "input_dtype": "float32", "nb_col": 5, "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_2", "nb_filter": 64, "border_mode": "valid", "nb_col": 5, "W_constraint": null, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "bias": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 40256, "trainable": true, "init": "glorot_uniform", "output_dim": 128, "b_regularizer": null, "name": "dense_1", "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"input_dim": 128, "trainable": true, "init": "glorot_uniform", "output_dim": 64, "b_regularizer": null, "name": "dense_2", "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"input_dim": 64, "trainable": true, "init": "glorot_uniform", "output_dim": 1, "b_regularizer": null, "name": "dense_3", "W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear"}}]}