{"config": [{"config": {"dim_ordering": "tf", "W_regularizer": null, "batch_input_shape": [null, 40, 80, 2], "b_regularizer": null, "nb_row": 5, "trainable": true, "nb_filter": 32, "border_mode": "valid", "activation": "relu", "bias": true, "activity_regularizer": null, "name": "convolution2d_1", "input_dtype": "float32", "init": "glorot_uniform", "W_constraint": null, "nb_col": 5, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "nb_row": 5, "trainable": true, "nb_filter": 64, "border_mode": "valid", "activation": "relu", "bias": true, "activity_regularizer": null, "name": "convolution2d_2", "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "nb_col": 5, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 128, "b_constraint": null, "activation": "relu", "name": "dense_1", "init": "glorot_uniform", "input_dim": 7616, "bias": true}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 64, "b_constraint": null, "activation": "relu", "name": "dense_2", "init": "glorot_uniform", "input_dim": 128, "bias": true}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 1, "b_constraint": null, "activation": "linear", "name": "dense_3", "init": "glorot_uniform", "input_dim": 64, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}