{"keras_version": "1.2.0", "config": [{"config": {"name": "convolution2d_1", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "b_constraint": null, "nb_filter": 16, "activation": "relu", "nb_row": 5, "border_mode": "valid", "nb_col": 5, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "input_dtype": "float32", "dim_ordering": "tf", "batch_input_shape": [null, 40, 80, 2]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_2", "init": "glorot_uniform", "trainable": true, "bias": true, "b_constraint": null, "nb_filter": 32, "activation": "relu", "nb_row": 5, "border_mode": "valid", "nb_col": 5, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_3", "init": "glorot_uniform", "trainable": true, "bias": true, "b_constraint": null, "nb_filter": 64, "activation": "relu", "nb_row": 3, "border_mode": "valid", "nb_col": 3, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "init": "glorot_uniform", "input_dim": 4800, "output_dim": 128, "bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "init": "glorot_uniform", "input_dim": 128, "output_dim": 64, "bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "init": "glorot_uniform", "input_dim": 64, "output_dim": 32, "bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_4", "init": "glorot_uniform", "input_dim": 32, "output_dim": 1, "bias": true, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}