{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 32, "nb_col": 5, "border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_1", "input_dtype": "float32", "nb_row": 5, "activation": "relu", "dim_ordering": "tf", "bias": true, "batch_input_shape": [null, 80, 160, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 64, "nb_col": 5, "border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_2", "nb_row": 5, "activation": "relu", "dim_ordering": "tf", "bias": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 128, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "input_dim": 40256, "activity_regularizer": null, "trainable": true, "name": "dense_1", "activation": "relu", "bias": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 64, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "input_dim": 128, "activity_regularizer": null, "trainable": true, "name": "dense_2", "activation": "relu", "bias": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "input_dim": 64, "activity_regularizer": null, "trainable": true, "name": "dense_3", "activation": "linear", "bias": true}}]}