{"config": [{"config": {"subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "bias": true, "b_regularizer": null, "nb_filter": 16, "activation": "relu", "batch_input_shape": [null, 40, 80, 2], "name": "convolution2d_1", "nb_row": 5, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dtype": "float32", "nb_col": 5, "trainable": true, "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "bias": true, "b_regularizer": null, "nb_filter": 32, "activation": "relu", "nb_col": 5, "nb_row": 5, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_2", "trainable": true, "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "bias": true, "b_regularizer": null, "nb_filter": 64, "activation": "relu", "nb_col": 3, "nb_row": 3, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_3", "trainable": true, "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 128, "b_constraint": null, "bias": true, "b_regularizer": null, "activation": "relu", "name": "dense_1", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 4800, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 64, "b_constraint": null, "bias": true, "b_regularizer": null, "activation": "relu", "name": "dense_2", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 128, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 32, "b_constraint": null, "bias": true, "b_regularizer": null, "activation": "relu", "name": "dense_3", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 64, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 1, "b_constraint": null, "bias": true, "b_regularizer": null, "activation": "linear", "name": "dense_4", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": 32, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}